general.internalServerError = Es ist ein Fehler aufgetreten. Bitte senden Sie eine Mail an info@egladil.de.
general.sessionTimeout = Ihre Session ist abgelaufen. Bitte loggen Sie sich erneut ein.
general.notAuthorized = Sie haben keine Berechtigung. Falls Sie ein Benutzerkonto haben, senden Sie bitte eine Mail an info@egladil.de.
general.actionNotAuthorized = Sie haben keine Berechtigung f\u00fcr diese Aktion.
general.notFound = Die angeforderte Ressource gibt es nicht.
general.unprocessableEntity = Der Request ist fehlerhaft und kann nicht verarbeitet werden.
general.forbidden = Diese Anfrage ist nicht erlaubt.
general.badRequest = Ihre Anfrage konnte nicht verarbeitet werden, da sie fehlerhafte Daten enthielt. Bitte schreiben Sie eine Mail an minikaenguru@egladil.de.
general.concurrent = Uuups, da hat sich die Anwendung verschluckt. Bitte wiederholen Sie die Aktion.
general.maxTrefferExceeded = Die Abfrage ergibt zu viele Treffer, bitte schr\u00e4nken Sie die Suche ein.
general.badRequest = Diese Aktion kann nicht ausgef\u00fchrt werden. Die Anfrage-Nachricht war fehlerhaft aufgebaut.

messaging.notAuthorized=Aufruf sync mit falscher sessionId

sendMail = Bitte senden Sie eine Mail an info@egladil.de.

tokens.clientAccessToken.error = Es ist ein Autorisierungsfehler aufgetreten. Bitte senden Sie eine Mail an info@egladil.de

ErrorResource.default = HTTP ERROR 500: Es ist ein interner Serverfehler aufgetreten.
ErrorResource.forbidden= HTTP ERROR 403: Der Zutritt zu dieser Seite ist dir leider verwehrt.
ErrorResource.notFound = HTTP ERROR 404: Die angeforderte Ressource gibt es nicht.
ErrorResource.duplicateEntry = HTTP ERROR 900: Dieses Objekt gibt es schon.

pendingRegistration = Ihre Registrierung wurde noch nicht vollst\u00e4ndig abgeschlossen. Bitte senden Sie eine Mail an info@egladil.de.

createUser.success = Ihr Benutzerkonto wurde angelegt und muss noch aktiviert werden. Bitte schauen Sie in Ihrem Postfach nach.
teilnahmenResource.anmelden.privat.success = Sie haben sich erfolgreich zum laufenden Minik\u00e4nguru-Wettbewerb angemeldet.
teilnahmenResource.anmelden.schule.success = Sie haben die {0} erfolgreich zum laufenden Minik\u00e4nguru-Wettbewerb angemeldet.

deregisterForNewsletterSuccess=Sie haben den Newsletter erfolgreich abbestellt.
registerForNewsletterSuccess=Sie haben den Newsletter erfolgreich abonniert.

vertragAdv.create.success=Sie haben f\u00fcr Ihre Schule erfolgreich einen Vertrag zur Auftragsdatenverarbeitung abgeschlossen.

lehrer.schulen.add.success=Sie haben sich erfolgreich an der neuen Schule als Lehrerin/Lehrer registriert.
lehrer.schulen.add.warn=An dieser Schule sind Sie bereits als Lehrerin/Lehrer registriert.

lehrer.schulen.remove.success=Sie haben sich erfolgreich von der Schule als Lehrerin/Lehrer abgemeldet.
lehrer.schulen.remove.nicht_registriert.warn=An dieser Schule waren Sie nicht als Lehrerin/Lehrer registriert.
lehrer.schulen.remove.schule_zum_wettbewerb_angemeldet.warn=Diese Schule ist bereits zum laufenden Wettbewerb angemeldet. Sie k\u00f6nnen sich erst nach Wettbewerbsende als Lehrerin/Lehrer abmelden.

de.egladil.constraints.invalidDate = ung\u00fcltiges Datum

# Auswertungen

checkKlasseDuplikat = Es gibt bereits eine Klasse mit Name {0}.

checkKindDuplikat.privat.nurVorname = Es gibt f\u00fcr {0} bereits ein Kind mit Vorname {1}. Sie k\u00f6nnen Nachname oder Zusatz verwenden, damit Sie die Urkunde sp\u00e4ter eindeutig zuordnen k\u00f6nnen. Wenn Sie nur die Sprache ge\u00e4ndert haben, handelt es sich wahrscheinlich nicht um eine Mehrfacherfassung.
checkKindDuplikat.privat.vornameNachname = Es gibt f\u00fcr {0} bereits ein Kind mit Vorname {1} und Nachname {2}. Sie k\u00f6nnen Zusatz verwenden, damit Sie die Urkunde sp\u00e4ter eindeutig zuordnen k\u00f6nnen. Wenn Sie nur die Sprache ge\u00e4ndert haben, handelt es sich wahrscheinlich nicht um eine Mehrfacherfassung.
checkKindDuplikat.privat.vornameNachnameZusatz = Es gibt f\u00fcr {0} bereits ein Kind mit Vorname {1}, Nachname {2} und Zusatz {3}. Sie werden die Urkunde sp\u00e4ter nicht eindeutig zuordnen k\u00f6nnen. Wenn Sie nur die Sprache ge\u00e4ndert haben, handelt es sich wahrscheinlich nicht um eine Mehrfacherfassung.

checkKindDuplikat.klasse.nurVorname = Es gibt in dieser Klasse bereits ein Kind mit Vorname {0} und Klassenstufe {1}. Sie k\u00f6nnen Nachname oder Zusatz verwenden, damit Sie die Urkunde sp\u00e4ter eindeutig zuordnen k\u00f6nnen. Wenn Sie nur die Sprache ge\u00e4ndert haben, handelt es sich wahrscheinlich nicht um eine Mehrfacherfassung.
checkKindDuplikat.klasse.vornameNachname = Es gibt in dieser Klasse bereits ein Kind mit Vorname {0}, Nachname {1} und Klassenstufe {2}. Sie k\u00f6nnen Zusatz verwenden, damit Sie die Urkunde sp\u00e4ter eindeutig zuordnen k\u00f6nnen. Wenn Sie nur die Sprache ge\u00e4ndert haben, handelt es sich wahrscheinlich nicht um eine Mehrfacherfassung.
checkKindDuplikat.klasse.vornameNachnameZusatz = Es gibt in dieser Klasse bereits ein Kind mit Vorname {0}, Nachname {1}, Zusatz {2} und Klassenstufe {3}. Sie werden die Urkunde sp\u00e4ter nicht eindeutig zuordnen k\u00f6nnen. Wenn Sie nur die Sprache ge\u00e4ndert haben, handelt es sich wahrscheinlich nicht um eine Mehrfacherfassung.


saveKlasse.success = Klasse {0} wurde erfolgreich gespeichert.
deleteKlasse.success = Klasse {0} wurde erfolgreich gel\u00f6scht.

saveKindSuccess.nurVorname = {0} wurde erfolgreich gespeichert.
saveKindSuccess.vornameNachname = {0} {1} wurde erfolgreich gespeichert.

deleteKindSuccess.nurVorname={0} wurde erfolgreich gel\u00f6scht.
deleteKindSuccess.vornameNachname = {0} {1} wurde erfolgreich gel\u00f6scht.

# Loesungszettel
loesungszettel.addOrChange.success = Der L\u00f6sungszettel wurde erfolgreich gespeichert: Punkte {0}, L\u00e4nge K\u00e4ngurusprung {1}.
loesungszettel.delete.success = Der L\u00f6sungszettel wurde erfolgreich gel\u00f6scht.
loesungszettel.delete.gesperrt = Dieser L\u00f6sungszettel ist aus dem Jahr {0}. Er kann nicht gel\u00f6scht werden.


loesungszettel.addOrChange.concurrent = Ein L\u00f6sungszettel f\u00fcr dieses Kind wurde bereits durch eine andere Person gespeichert. Bitte pr\u00fcfen Sie die neuen Daten. Punkte {0}, L\u00e4nge K\u00e4ngurusprung {1}.
loesungszettel.add.datenInkonsistent = Der L\u00f6sungszettel konnte leider nicht gespeichert werden. Bitte erfassen Sie den L\u00f6sungszettel f\u00fcr das Kind neu.
loesungszettel.add.nurUpload = Der L\u00f6sungszettel konnte leider nicht gespeichert werden, da bereits Auswertungen hochgeladen wurden.
loesungszettel.addOrChange.invalidArguments = Der L\u00f6sungszettel konnte leider nicht gespeichert werden: {0}. Bitte wenden Sie sich per Mail an info@egladil.de.
loesungszettel.change.gesperrt = Dieser L\u00f6sungszettel ist aus dem Jahr {0}. Er kann nicht ge\u00e4ndert werden.

loesungszettel.change.kindConcurrentlyDeleted = Das Kind wurde in der Zwischenzeit gel\u00f6scht. Bitte kl\u00e4ren Sie dies im Kollegium.


# Schulauswertung

schulauswertung.pdf.dateiname.schule = minikaenguru_{0}_{1}_ergebnisse.pdf
schulauswertung.pdf.uebersicht.section.klassenstufe = Ergebnisse {0}
schulauswertung.pdf.uebersicht.platz_und_kind = {0} {1} ({2}): {3} Punkte
schulauswertung.pdf.uebersicht.section.gewinner.kaengurusprung = weitester K\u00e4ngurusprung:
schulauswertung.pdf.uebersicht.gewinner.kaengurusprung = {0} ({1}): L\u00e4nge K\u00e4ngurusprung {2}
schulauswertung.pdf.uebersicht.mehrere_kaenguruspruenge = {0} Kinder haben den weitesten K\u00e4ngurusprung (L\u00e4nge = {1}) gemacht. Daher werden keine Urkunden f\u00fcr den K\u00e4ngurusprung generiert. Wenn Sie die Urkunden vergeben m\u00f6chten, generieren Sie diese bitte in der Minik\u00e4nguru-Anwendung f\u00fcr folgende Kinder selbst:

# Statistik

## Open Data
open_data.gesamt.keineDatenVorhanden = F\u00fcr das Jahr {0} liegen keine Daten vor.
open_data.klassenstufe.keineDatenVorhanden = Im Jahr {0} liegen keine Daten f\u00fcr {1} vor.


statistik.gesamtpunktverteilung.headline=Ergebnisse {0} - {1}
statistik.gesamtpunktverteilung.grundlage.description=Die Punktverteilung wurde auf der Grundlage der zur\u00fcckgesendeten Ergebnisse von {0} Kindern ermittelt.
statistik.gesamtpunktverteilung.bewertung.description=Die Kinder erhielten ein Startguthaben von {0} Punkten. F\u00fcr falsch gel\u00f6ste Aufgaben wurden abgezogen: 0,75 Punkte bei 3-Punkte-Aufgaben, 1 Punkt bei 4-Punkte-Aufgaben, 1,25 Punkte bei 5-Punkte-Aufgaben.
statistik.gesamtpunktverteilung.mediantext="Der Median (Prozentrang 50) liegt bei {0} Punkten.
statistik.gesamtpunktverteilung.sectioneinzel = L\u00f6sungen je Aufgabe

statistik.pdf.autorin_und_url = Hei\u00dfe Winkelvo\u00df - mathe-jung-alt.de/minikaenguru
statistik.pdf.ueberschrift.wettbewerb = Minik\u00e4nguru-Wettbewerb {0} - Gesamtpunktverteilung
statistik.pdf.median.klassenstufe.text = Der Median (Prozentrang 50) f\u00fcr {0} lag bei {1} Punkten.

statistik.pdf.ueberschrift.klassenstufe = Ergebnisse f\u00fcr {0}


statistik.pdf.dateiname.schule = minikaenguru_{0}_schulstatistik.pdf
statistik.pdf.dateiname.privat = minikaenguru_{0}_statistik.pdf

statistik.definitionen.median.veranstalter = Der Median (Prozentrang 50) ist die mittlere erreichte Punktzahl aller Kinder: die H\u00e4lfte aller teilnehmenden Kinder mit dieser Klassenstufe hat gleich viele oder weniger Punkte erzeilt.
statistik.definitionen.median.gesamtverteilung = Der Median ist der Prozentrang 50. Die H\u00e4lfter der Kinder hat gleich viele oder weniger Punkte erzielt.
statistik.definitionen.prozentrang = Der Prozentrang gibt an, wie viele Kinder ein gleiches oder schlechteres Ergebnis erzielten.
statistik.pdf.definitionen.inhaltDokument.veranstalter = Die folgenden Seiten zeigen je Klassenstufe die \u00dcbersicht \u00fcber die gel\u00f6sten Aufgaben sowie die erreichten Punkte.
statistik.pdf.definitionen.inhaltDokument.gesamtverteilung = Die folgenden Seiten zeigen je Klassenstufe die \u00dcbersicht \u00fcber die gel\u00f6sten Aufgaben sowie die Prozentr\u00e4nge.
statistik.pdf.gesamtverteilung.keineDaten = F\u00fcr diesen Wettbewerb sind keine Daten vorhanden.

statistik.pdf.median.wettbewerb = (Gesamtmedian {0}: {1})
statistik.pdf.median.schule.text = Schulmedian {0} : {1}
statistik.pdf.median.privat.text = Median {0} : {1}
statistik.pdf.ueberschrift.schule.normal = Minik\u00e4nguru-Wettbewerb {0} {1}
statistik.pdf.ueberschrift.schule.nameUnbekannt = Minik\u00e4nguru-Wettbewerb {0} - Schul\u00fcbersicht
statistik.pdf.ueberschrift.privatveranstalter = Minik\u00e4nguru-Wettbewerb {0} - Teilnahme\u00fcbersicht


statistik.pdf.aufgabenuebersicht.header = Aufgaben\u00fcbersicht {0} - Anzahl Kinder: {1}
statistik.pdf.rohpunktuebersicht.header = Rohpunkte {0}
statistik.pdf.prozentranguebersicht.header = Prozentr\u00e4nge {0}

statistik.keineDaten = F\u00fcr Ihre Anfrage sind keine Daten vorhanden.

statistik.prozentrang.punkteNegativ = Weniger als 0 Punkte k\u00f6nnen nicht erzielt werden.
statistik.prozentrang.punkteZuHoch = F\u00fcr Klassenstufe {0} muss die Eingabe zwischen 0 und {1} liegen.
statistik.prozentrang.exakterTreffer.text = {0} haben {1} Prozent aller Kinder das gleiche oder ein schlechteres Ergebnis erzielt.
statistik.prozentrang.exakterTreffer.maximalSingular.text = Das ist die h\u00f6chste erreichbare Punktzahl. {0} hat 1 Kind das gleiche Ergebnis erzielt.
statistik.prozentrang.exakterTreffer.maximalPlural.text = Das ist die h\u00f6chste erreichbare Punktzahl. {0} haben {1} Kinder das gleiche Ergebnis erzielt.
statistik.prozentrang.innerhalbIntervall.text = {0} haben {1} Prozent aller Kinder ein schlechteres Ergebnis erzielt.
statistik.prozentrang.schlechterAlsAlle.text = {0} haben alle Kinder ein besseres Ergebnis erzielt.
statistik.prozentrang.besserAlsAlle.text = Das ist die h\u00f6chste erreichbare Punktzahl. {0} hat kein Kind eine so hohe Punktzahl erzielt.

unterlagen.nichtVerfuegbar = Die Unterlagen stehen nicht zur Verf\u00fcgung. Falls Sie ein Benutzerkonto haben, senden Sie bitte eine Mail an info@egladil.de.

### upload
upload.unbekannterMediaType = Die hochgeladene Datei kann nicht verarbeitet werden. Bitte senden Sie eine Mail an info@egladil.de.
upload.dangerousContent = Die hochgeladene Datei kann nicht verarbeitet werden. Bitte pr\u00fcfen Sie Ihren Rechner auf Viren.
upload.exists = Diese Datei wurde bereits hochgeladen. Falls Sie die Datei nicht selbst bereits hochgeladen haben, k\u00f6nnte sie eine Kollegin oder ein Kollege hochgeladen haben.
upload.maxSizeExceeded = Die Datei ist zu gro\u00df.

## Auswertung
auswertungimport.success = Die Auswertung wurde erfolgreich importiert. Vielen Dank!
auswertungimport.forbidden.nochKeineAnmeldungen = Auswertungen k\u00f6nnen noch nicht hochgeladen werden, da der Anmeldezeitraum noch nicht begonnen hat.
auswertungimport.forbidden.wettbewerbBeendet = Auswertungen k\u00f6nnen nicht mehr hochgeladen werden, da der Wettbewerb beendet ist. Bitte senden Sie Ihre Auswertungen per Mail an minikaenguru@egladil.de.
auswertungimport.forbidden.nichtAngemeldet = Sie k\u00f6nnen keine Auswertungen f\u00fcr diese Schule hochladen, da sie noch nicht zum aktuellen Wettbewerb angemeldet ist.
auswertungimport.forbidden.downloadNichtErlaubt = Sie k\u00f6nnen keine Auswertungen f\u00fcr diese Schule hochladen, da die Aufgaben noch nicht zur Verf\u00fcgung gestellt wurden.
auswertungimport.forbidden.nurOnline = Sie k\u00f6nnen keine Auswertungen f\u00fcr diese Schule hochladen, da bereits L\u00f6sungszettel online erfasst wurden.
auswertungimport.error = Die Auswertung konnte wegen eines Fehlers leider nicht importiert werden. Bitte senden Sie eine Mail an minikaenguru@egladil.de.
auswertungimport.datenfehler.lehrer = Die Auswertung wurde erfolgreich hochgeladen. Sie muss noch nachbearbeitet werden. Die Statistik steht Ihnen in einigen Tagen zur Verf\u00fcgung.
auswertungimport.datenfehler.admin = Die Datei "{0}" enth\u00e4lt fehlerhafte Zeilen. Upload-ID={1}, Teilnahmenummer={2}
auswertungimport.ohneUeberschrift.lehrer =  Die Auswertung wurde erfolgreich hochgeladen. Sie muss noch nachbearbeitet werden. Die Statistik steht Ihnen in einigen Tagen zur Verf\u00fcgung.
auswertungimport.ohneUeberschrift.admin =  Bei der Datei "{0}" fehlt die \u00dcberscrift. Upload-ID={1}, Teilnahmenummer={2}
auswertungimport.leer.lehrer = Die Datei "{0}" war leider leer.
auswertungimport.leer.admin = Die Datei "{0}" war leer oder es fehlte die \u00dcberschriftzeile A-1,A-2.... Upload-ID={1}, Teilnahmenummer={2}

auswertungsimport.bereitsImportiert.abgewiesen.lehrer = Die Auswertung konnte nicht importiert werden (Wettbewerb beendet, Auswertung leer oder Datenfehler).
auswertungsimport.bereitsImportiert.abgewiesen.admin = Auswertung abgewiesen, leer oder fehlerhaft. Upload-ID={0}, Teilnahmenummer={1}

auswertungsimport.bereitsImportiert.datenfehler.lehrer = Die Auswertung wurde bereits einmal erfolgreich hochgeladen. Sie muss noch nachbearbeitet werden. Die Statistik steht Ihnen in einigen Tagen zur Verf\u00fcgung.
auswertungsimport.bereitsImportiert.datenfehler.admin = Auswertung leer oder fehlerhaft. Upload-ID={0}, Teilnahmenummer={1}

auswertungsimport.bereitsImportiert.exception.lehrer = Die Auswertung konnte wegen eines Serverfehlers nicht importiert werden. Bitte senden Sie Ihre Auswertungen per Mail an minikaenguru@egladil.de.
auswertungsimport.bereitsImportiert.exception.admin = Import mit Serverfehler fehlgeschlagen. Upload-ID={0}, Teilnahmenummer={1}

## Klassen
klassenimport.forbidden.nochKeineAnmeldungen = Klassenlisten k\u00f6nnen noch nicht hochgeladen werden, da der Anmeldezeitraum hat noch nicht begonnen hat.
klassenimport.forbidden.wettbewerbBeendet = Klassenlisten k\u00f6nnen nicht mehr hochgeladen werden, da der Wettbewerb beendet ist.
klassenimport.forbidden.nichtAngemeldet = Sie k\u00f6nnen keine Klassenliste f\u00fcr diese Schule hochladen, da sie noch nicht zum aktuellen Wettbewerb angemeldet ist.
klassenimport.forbidden.hochgeladeneAuswertung = Sie k\u00f6nnen keine Klassenliste f\u00fcr diese Schule hochladen, da bereits eine Auswertungstabelle hochgeladen wurde.
klassenimport.success = Die Daten wurden erfolgreich importiert. Bitte pr\u00fcfen Sie, ob Umlaute korrekt angezeigt werden.
klassenimport.nichtVollstaendig = Einige Kinder konnten nicht importiert werden. Einen Fehlerreport k\u00f6nnen Sie mit dem Link herunterladen. Kinder mit unklarer Klassenstufe oder Doppeleintr\u00e4ge wurden markiert. Bitte pr\u00fcfen Sie au\u00dferdem, ob Umlaute korrekt angezeigt werden.
klassenimport.vollstaendigMitWarnung = Bei einigen Kindern war die Klassenstufe nicht korrekt und wurde automatisch auf 2 gesetzt. Es gab m\u00f6glicherweise Doppeleintr\u00e4ge. Alle betroffenen Kinder wurden markiert. Bitte pr\u00fcfen Sie au\u00dferdem, ob Umlaute korrekt angezeigt werden.
klassenimport.vollstaendigMitWarnungNurKlassenstufe = Bei einigen Kindern war die Klassenstufe nicht korrekt und wurde automatisch auf 2 gesetzt. Bitte pr\u00fcfen Sie au\u00dferdem, ob Umlaute korrekt angezeigt werden.
klassenimport.vollstaendigMitWarnungNurDublette = Es gab m\u00f6glicherweise Doppeleintr\u00e4ge. Alle betroffenen Kinder wurden markiert.
klassenimport.error = Die Klassenliste konnte wegen eines Fehlers leider nicht importiert werden. Bitte senden Sie eine Mail an info@egladil.de.
klassenimport.keineKlasseImportiert = Die Klassenliste konnte nicht importiert werden: alle Zeilen waren fehlerhaft. Bitte pr\u00fcfen Sie die hochgeladene Datei. Einen Fehlerreport k\u00f6nnen Sie mit dem Link herunterladen.
